jonsmirl/mpc5200/sound/soc/codecs/lpc315x_codec.h
/*
 * sound/soc/codecs/lpc315x_codec.h
 *
 * Author: Kevin Wells <kevin.wells@nxp.com>
 *
 * Copyright (C) 2010 NXP Semiconductors
 *
 * This program is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation; either version 2 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 */
#ifndef _LPC315X_CODEC_H
#define _LPC315X_CODEC_H

/* LPC315X CODEC register addresses */
#define LPC315X_CODEC_CODEC_START	(0x00000010)

#define LPC315X_CODEC_CGU		(0x00000002)
#define LPC315X_CODEC_PGA		(0x00000010)
#define LPC315X_CODEC_AIN1		(0x00000011)
#define LPC315X_CODEC_AOUT		(0x00000012)
#define LPC315X_CODEC_DEC		(0x00000013)
#define LPC315X_CODEC_INT0		(0x00000014)
#define LPC315X_CODEC_INT1		(0x00000015)
#define LPC315X_CODEC_I2SMUX1		(0x00000016)
#define LPC315X_CODEC_DEC_STA		(0x00000017)

#define LPC315X_CODEC_NUM_REGS	(0x8)

/* PGA register bit definitions */
#define LPC315X_CODEC_PGA_RC		(0x0000000F)
#define LPC315X_CODEC_PGA_MIC		(0x000000F0)
#define LPC315X_CODEC_PGA_LC		(0x00000F00)

/* AIN1 register bit definitions */
#define LPC315X_CODEC_AIN1_XFBADR		(0x00000001)
#define LPC315X_CODEC_AIN1_XFBADL		(0x00000002)
#define LPC315X_CODEC_AIN1_DITHR		(0x00000004)
#define LPC315X_CODEC_AIN1_PD_VCOM_VREF1	(0x00000010)
#define LPC315X_CODEC_AIN1_PD_BIAS		(0x00000020)
#define LPC315X_CODEC_AIN1_PD_ADCR		(0x00000040)
#define LPC315X_CODEC_AIN1_PD_ADCL		(0x00000080)
#define LPC315X_CODEC_AIN1_PD_SDCR		(0x00000100)
#define LPC315X_CODEC_AIN1_PD_SDCM		(0x00000200)
#define LPC315X_CODEC_AIN1_PD_SDCL		(0x00000400)
#define LPC315X_CODEC_AIN1_PD_PGAR		(0x00000800)
#define LPC315X_CODEC_AIN1_PD_PGAM		(0x00001000)
#define LPC315X_CODEC_AIN1_PD_PGAL		(0x00002000)
#define LPC315X_CODEC_AIN1_PD_LNA		(0x00004000)

#define LPC315X_CODEC_AIN1_BIAS_OFF		(0x00007FFF)

/* MUX0 & MUX1 input selection for right channel */
#define LPC315X_CODEC_AIN1_MUXR_MSK		(0x00018000)
#define LPC315X_CODEC_AIN1_MUXR_TIN		(0x00000000)
#define LPC315X_CODEC_AIN1_MUXR_LIN		(0x00008000)
#define LPC315X_CODEC_AIN1_MUXR_MIN_TBY		(0x00010000)
#define LPC315X_CODEC_AIN1_MUXR_MIN_LBY		(0x00018000)

/* MUX0 & MUX1 input selection for left channel */
#define LPC315X_CODEC_AIN1_MUXL_MSK		(0x00060000)
#define LPC315X_CODEC_AIN1_MUXL_TIN		(0x00000000)
#define LPC315X_CODEC_AIN1_MUXL_LIN		(0x00020000)
#define LPC315X_CODEC_AIN1_MUXL_MIN_TBY		(0x00040000)
#define LPC315X_CODEC_AIN1_MUXL_MIN_LBY		(0x00060000)

/* AOUT register bit definitions */
#define LPC315X_CODEC_AOUT_PD_ANVC_R		(0x00000001)
#define LPC315X_CODEC_AOUT_PD_ANVC_L		(0x00000002)
#define LPC315X_CODEC_AOUT_PD_SET_DWA		(0x00000004)
#define LPC315X_CODEC_AOUT_PD_SET_I2S_FMT	(0x00000008)
#define LPC315X_CODEC_AOUT_PD_SDAC_R		(0x00000010)
#define LPC315X_CODEC_AOUT_PD_SDAC_L		(0x00000020)

#define LPC315X_CODEC_AOUT_CTRL_SET_LMT		(0x000000C0)

#define LPC315X_CODEC_AOUT_PD_HP_R		(0x00001000)
#define LPC315X_CODEC_AOUT_PD_HP_C		(0x00002000)
#define LPC315X_CODEC_AOUT_PD_HP_L		(0x00004000)
#define LPC315X_CODEC_AOUT_VREF_SLOW		(0x00008000)
#define LPC315X_CODEC_AOUT_VREF_SLOW_UP		(0x40000000)
#define LPC315X_CODEC_AOUT_SWDAC_ON		(0x80000000)

#define LPC315X_CODEC_AOUT_AVC_COA_GAIN_POS	(16)
#define LPC315X_CODEC_AOUT_AVC_COA_GAIN_MSK	(0x07FF0000)
#define LPC315X_CODEC_AOUT_AVC_FIN_GAIN_POS	(27)
#define LPC315X_CODEC_AOUT_AVC_FIN_GAIN_MSK	(0x38000000)

/* I2S MUX - Format values */
#define LPC315X_CODEC_I2SMUX1_TX_FMT_MSK	(0x00000007)
#define LPC315X_CODEC_I2SMUX1_TX_FMT_I2S	(0x00000003)
#define LPC315X_CODEC_I2SMUX1_TX_FMT_LSB_16	(0x00000004)
#define LPC315X_CODEC_I2SMUX1_TX_FMT_LSB_18	(0x00000005)
#define LPC315X_CODEC_I2SMUX1_TX_FMT_LSB_20	(0x00000006)
#define LPC315X_CODEC_I2SMUX1_TX_FMT_LSB_24	(0x00000007)

#define LPC315X_CODEC_I2SMUX1_RX_FMT_MSK	(0x00000700)
#define LPC315X_CODEC_I2SMUX1_RX_FMT_DAD	(0x00000000)
#define LPC315X_CODEC_I2SMUX1_RX_FMT_SPD	(0x00000100)
#define LPC315X_CODEC_I2SMUX1_RX_FMT_I2S	(0x00000300)
#define LPC315X_CODEC_I2SMUX1_RX_FMT_LSB_16	(0x00000400)
#define LPC315X_CODEC_I2SMUX1_RX_FMT_LSB_18	(0x00000500)
#define LPC315X_CODEC_I2SMUX1_RX_FMT_LSB_20	(0x00000600)
#define LPC315X_CODEC_I2SMUX1_RX_FMT_LSB_24	(0x00000700)

#define LPC315X_CODEC_I2SMUX1_DEMUX_MSK		(0x00010000)

/* INT0 Register bit definitions */
#define	LPC315X_CODEC_INT0_PD_DAC		(0x00000080)
#define	LPC315X_CODEC_INT0_SET_SIL		(0x00000008)

/* Analog CGU register bit definitions */
#define	LPC315X_CODEC_CGU_CLKDAC_INV		(0x00800000)
#define	LPC315X_CODEC_CGU_ADCSYS_256FS		(0x00100000)
#define	LPC315X_CODEC_CGU_ADC1_OFF		(0x00080000)
#define	LPC315X_CODEC_CGU_ADC2_128FS		(0x00040000)
#define	LPC315X_CODEC_CGU_CLKDAC_256FS		(0x00020000)
#define	LPC315X_CODEC_CGU_CLKINT_256FS		(0x00010000)

/* Playback clocks */
#define	LPC315X_CODEC_CGU_PD_I2C256FS_CLK	(0x00000001)
#define	LPC315X_CODEC_CGU_PD_DSP_CLK		(0x00000002)
#define	LPC315X_CODEC_CGU_PD_NS_CLK		(0x00000004)
#define	LPC315X_CODEC_CGU_PD_I2SRX_BCLK		(0x00000040)
#define	LPC315X_CODEC_CGU_PD_I2SRX_SYSCLK	(0x00000080)
#define	LPC315X_CODEC_CGU_PD_DAC_CLK		(0x00000800)

/* Recording clocks */
#define	LPC315X_CODEC_CGU_PD_DEC_CLK		(0x00000008)
#define	LPC315X_CODEC_CGU_PD_I2STX_BCLK		(0x00000010)
#define	LPC315X_CODEC_CGU_PD_I2STX_SYSCLK	(0x00000020)
#define	LPC315X_CODEC_CGU_PD_ADC2_CLK		(0x00001000)
#define	LPC315X_CODEC_CGU_PD_ADC1_CLK		(0x00002000)
#define	LPC315X_CODEC_CGU_PD_ADCSYS_CLK		(0x00004000)

/* INT1 register definitions */
#define	LPC315X_CODEC_INT1_MAS_MUTE		(0x00010000)
#define	LPC315X_CODEC_INT1_MAS_VOL_L_POS	(0)
#define	LPC315X_CODEC_INT1_MAS_VOL_L_MSK	(0x000000FF)
#define	LPC315X_CODEC_INT1_MAS_VOL_R_POS	(8)
#define	LPC315X_CODEC_INT1_MAS_VOL_R_MSK	(0x0000FF00)

/* Decimator register bits */
#define	LPC315X_CODEC_DEC_GAIN_R_MASK		(0x000000FF)
#define	LPC315X_CODEC_DEC_GAIN_L_MASK		(0x0000FF00)
#define	LPC315X_CODEC_DEC_GAIN_R_POS		(0)
#define	LPC315X_CODEC_DEC_GAIN_L_POS		(8)
#define	LPC315X_CODEC_DEC_DC_IN_FIL		(0x00080000)
#define	LPC315X_CODEC_DEC_DC_OUT_FIL		(0x00040000)
#define	LPC315X_CODEC_DEC_MUTE			(0x00200000)
#define	LPC315X_CODEC_DEC_AGC_EN		(0x00400000)

extern struct snd_soc_codec_device soc_codec_lpc315x_dev;
extern struct snd_soc_dai lpc315x_codec_dais[];

#endif
